#!/bin/bash
# -*- coding: utf-8 -*-
'''
@author liangzhicheng
@data 2016-12-19 10:00:00
'''

# 冒险 4
Adventure \
    = [
    ['隔离岛', '大火', '三十年', '警校'],
    ['神奇动物在哪里', '纽约城', '魔法', '卡曼'],
    ['神奇动物在哪里', '纽约城', '魔法', '卡曼'],
    ['佩小姐的奇幻城堡', '女孩', '阿沙', '心心']
]
# 剧情 31
Drama \
    = [
    ['蜡笔小新:梦境世界大突击', '摩利', '风间彻', '部市'],
    ['建党伟业', '中华民国', '马少骅', '新的篇章'],
    ['外公芳龄38', '买一送一', '外卖', '何志武'],
    ['不离不弃', '陶彦达', '逃婚', '叶小眉'],
    ['我不是潘金莲', '十年', '一件', '变成'],
    ['比利·林恩的中场战事', '士兵', '芳汀', '借由'],
    ['邻家大贱谍', '费安纳', '基斯', '杰夫'],
    ['减法人生', '蛋糕店', '关晓康', '房租'],
    ['生死96小时', '红军', '赵勇率', '云鹜'],
    ['最后证言', '丢失', '男孩', '循线'],
    ['非常绑架', '何家成', '强子', '北漂'],
    ['情比山高', '滇缅公路', '云南', '本片'],
    ['兄弟之北漂歌手', '酒吧', '音乐', '佳佳'],
    ['少年梦', '创业', '杨帅', '发展'],
    ['少年梦', '创业', '杨帅', '发展'],
    ['塔洛', '单纯', '塔洛', '牧羊人'],
    ['你的名字。', '少女', '一名', '千年一遇'],
    ['骆驼客2：箭在弦', '二尕子', '刀客', '通缉'],
    ['红小鬼齐步走', '李小虎', '王俊凯', '十多岁'],
    ['热土悲歌', '壮歌', '之魂', '燕赵'],
    ['三少爷的剑', '谢晓峰', '三万里', '剑气'],
    ['东宫皇子', '星球', '战队', '逆臣'],
    ['血战钢锯岭', '军医', '斯蒙德', '改编自'],
    ['锅是铁', '郭世铁', '餐馆', '爱好文艺'],
    ['爱你的人', '回家路上', '命悬', '刚上'],
    ['萨利机长', '机长', '切斯', '舒伦'],
    ['试睡员48小时', '睡员', '酒店', '吃住行'],
    ['罗曼蒂克消亡史', '初才', '香港', '坐上去'],
    ['先锋之那时青春', '遵义会议', '毛主席', '情报'],
    ['长城', '威廉', '重重围困', '当一波'],
    ['流金', '狗头', '凤凰', '情色']
]

# 动作 5
Action \
    = [
    ['奇异博士', '斯特兰', '本尼迪克', '神经外科'],
    ['冲天火', '大火', '吴彦祖', '张静初'],
    ['冲天火', '大火', '吴彦祖', '张静初'],
    ['极速之巅', '斯登', '偷车', '玛尔'],
    ['反黑行动组', '盗窃案', '布伦为', '黑组']
]
# 动画 3
Cartoon \
    = [
    ['航海王之黄金城', '剧场版', '圣域', '海贼王'],
    ['海洋奇缘', '部落', '叫摩瓦娜', '卡瓦略'],
    ['名侦探柯南：纯黑的恶梦', '间谍', '日本', '柯南']
]
# 喜剧 12
Comedy \
    = [
    ['夺路而逃', '宿醉', '周晓易', '何云伟'],
    ['被劫持的爱情', '行窃', '日久生', '年轻夫妻'],
    ['辣警霸王花', '警校', '团队', '霸王花'],
    ['脱单宝典', '策划', '责编', '晓新'],
    ['阿拉丁与神灯', '阿拉丁', '神灯', '魔法师'],
    ['最萌身高差', '身高', '张潇', '夏汐'],
    ['最萌身高差', '身高', '张潇', '夏汐'],
    ['越囧', '马德钟', '越南语', '白小白'],
    ['28岁未成年', '凉夏', '倪妮', '产生矛盾'],
    ['呆呆计划', '安静', '赌债', '洗码'],
    ['爱上试睡师', '潇潇', '酒店', '睡员罗'],
    ['功夫四侠', '神佑', '邪恶', '之地']
]
# 恐怖 7
Dracula \
    = [
    ['诡咒', '白雪', '高伟', '奇大'],
    ['白云桥', '一半', '两界', '钟萱'],
    ['怨灵地下室', '邓家', '医病', '鳏寡孤独'],
    ['白云桥', '一半', '两界', '钟萱'],
    ['怨灵地下室', '邓家', '医病', '鳏寡孤独'],
    ['食人岛', '凯迪', '好奇者', '微信'],
    ['恐怖理发店', '小满', '深山中', '女鬼']
]
# 武侠 1
Swordsmen \
    = [
    ['武林探秘', '武术', '中华', '探秘']
]
# 爱情 6
Love \
    = [
    ['聊斋新编之画皮新娘', '恐怖电影', '画皮', '聊斋'],
    ['我是处女座', '故事', '女孩', '寻求'],
    ['夏威夷之恋', '实习医生', '姜成', '陈妍希'],
    ['间谍同盟', '歌迪亚', '女战士', '布拉德'],
    ['那年夏天你去了哪里', '绑架', '阿樱', '少女'],
    ['有迹可循', '小棠', '周海', '北漂']
]


def loadDataSet(dataType):
    '''
    贝叶斯测试数据集
    :return:
    '''
    postingList = ''
    classVec = ''
    if dataType == 'DC':
        postingList = Drama + Cartoon
        classVec = tuples_2_numpy([[31, 0], [3, 1]])  # 0:剧情  1:动画
    if dataType == 'AS':
        postingList = Action + Swordsmen
        classVec = tuples_2_numpy([[5, 0], [1, 1]])  # 0:动作  1:武侠
    if dataType == 'CD':
        postingList = Comedy + Dracula
        classVec = tuples_2_numpy([[12, 0], [7, 1]])  # 0:喜剧  1:恐怖
    if dataType == 'L':
        postingList = Love
        classVec = tuples_2_numpy([[6, 1]])  # 0:爱情
    return postingList, classVec


def tuples_2_numpy(data):
    '''
    [3,1] ===> [1,1,1]
    :param data:
    :return:
    '''
    classVec = []
    for tuples in data:
        number = tuples[0]
        element = tuples[1]
        for n in range(0, number):
            classVec.append(element)
    return classVec
